УТ_для_edt/src/Documents/смартASP_БонусыЗаСервисноеОбслуживание/смартASP_БонусыЗаСервисноеОбслуживание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартASP_БонусыЗаСервисноеОбслуживание</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <registerRecords>AccumulationRegister.смартASP_НакоплениеБонусов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартСтатусРасчетаБонусов</name>
    <comment>#1288 Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров</comment>
    <type>
      <types>EnumRef.смартСтатусыДокументовРасчетаБонусов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НачислениеБонусов</name>
    <attributes>
      <name>Инженер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКВыплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийВид</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РаспорядокРаботы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КвалификацияЗнания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Инструменты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗвонокКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодготовкаКЗаявке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоведениеУКлиента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПравилаВыполненияРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗавершениеЗаявки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОформлениеДокументов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоммуникацияСКлиентом</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РаботаСПроизводителем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РаботаСМенеджером</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Командировка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/смартASP_Тарифы/смартASP_Тарифы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартASP_Тарифы</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Тариф</name>
    <type>
      <types>EnumRef.смартASP_ТипыТарифов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартASP_КомментарииДляЯчеек/смартASP_КомментарииДляЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартASP_КомментарииДляЯчеек</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Инженер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипБонуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартСтатусыДокументовРасчетаБонусов/смартСтатусыДокументовРасчетаБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыДокументовРасчетаБонусов</name>
  <comment>#1288 Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров</comment>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗавершен</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартASP_БонусыЗаСервисноеОбслуживание/Forms/ФормаДокумента/Module.bsl
//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Функция НачислениеБонусовПриНачалеРедактированияНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ASP_ТарифыСрезПоследних.Тариф КАК Тариф,
		|	ASP_ТарифыСрезПоследних.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.смартASP_Тарифы.СрезПоследних(&Дата, ) КАК ASP_ТарифыСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", КонецМесяца(Объект.Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Тарифы = Новый Структура;
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Тарифы;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Тарифы.Вставить(ПолучитьИмяПеречисления(ВыборкаДетальныеЗаписи.Тариф), ВыборкаДетальныеЗаписи.Значение);	
	КонецЦикла;
	
	Возврат Тарифы;
КонецФункции

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура НачислениеБонусовПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НЕ НоваяСтрока Тогда
		Возврат;
	КонецЕсли;
	
	Тарифы = НачислениеБонусовПриНачалеРедактированияНаСервере();
	
	Если НЕ Тарифы.Свойство("БазовыйТариф") И НЕ Тарифы.Свойство("ПовышенныйТариф") Тогда
		Возврат;
	КонецЕсли;
	
	Элемент.ТекущиеДанные.ВнешнийВид			= Тарифы.БазовыйТариф;
	Элемент.ТекущиеДанные.РаспорядокРаботы		= Тарифы.БазовыйТариф;
	Элемент.ТекущиеДанные.КвалификацияЗнания	= Тарифы.БазовыйТариф;
	Элемент.ТекущиеДанные.Инструменты			= Тарифы.БазовыйТариф;
	Элемент.ТекущиеДанные.ЗвонокКлиенту 		= Тарифы.БазовыйТариф;
	Элемент.ТекущиеДанные.ПодготовкаКЗаявке		= Тарифы.БазовыйТариф;
	Элемент.ТекущиеДанные.ПоведениеУКлиента		= Тарифы.БазовыйТариф;
	Элемент.ТекущиеДанные.ПравилаВыполненияРабот= Тарифы.БазовыйТариф;
	Элемент.ТекущиеДанные.ЗавершениеЗаявки		= Тарифы.БазовыйТариф;
	Элемент.ТекущиеДанные.ОформлениеДокументов	= Тарифы.ПовышенныйТариф;
	Элемент.ТекущиеДанные.КоммуникацияСКлиентом	= Тарифы.БазовыйТариф;
	Элемент.ТекущиеДанные.РаботаСПроизводителем	= Тарифы.БазовыйТариф;
	Элемент.ТекущиеДанные.РаботаСМенеджером		= Тарифы.БазовыйТариф;
	Элемент.ТекущиеДанные.Командировка			= Тарифы.БазовыйТариф;
	
	Элемент.ТекущиеДанные.СуммаКВыплате			= (Тарифы.БазовыйТариф * 13) + Тарифы.ПовышенныйТариф;
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Функция ПолучитьИмяПеречисления(Значение)
     Если Значение.Пустая() Тогда
         Возврат "";
     КонецЕсли;

	ИмяПеречисления = Значение.Метаданные().Имя;
	НужныйИндекс = Перечисления[ИмяПеречисления].Индекс(Значение);
	ИмяЗначения = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления[НужныйИндекс].Имя;     
	       
	Возврат ИмяЗначения;        
КонецФункции

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура НачислениеБонусовПриИзменении(Элемент)
	СтрокаТЧ = Элементы.НачислениеБонусов.ТекущиеДанные;
	СтрокаТЧ.СуммаКВыплате = СтрокаТЧ.ВнешнийВид + СтрокаТЧ.РаспорядокРаботы + СтрокаТЧ.КвалификацияЗнания + СтрокаТЧ.Инструменты
				+ СтрокаТЧ.ЗвонокКлиенту + СтрокаТЧ.ПодготовкаКЗаявке + СтрокаТЧ.ПоведениеУКлиента + СтрокаТЧ.ПравилаВыполненияРабот 
				+ СтрокаТЧ.ЗавершениеЗаявки + СтрокаТЧ.ОформлениеДокументов + СтрокаТЧ.КоммуникацияСКлиентом + СтрокаТЧ.РаботаСПроизводителем
				+ СтрокаТЧ.РаботаСМенеджером + СтрокаТЧ.Командировка;
				
	Массив = Новый Массив;
	Массив.Добавить(СтрокаТЧ.КвалификацияЗнания);
	Массив.Добавить(СтрокаТЧ.ЗавершениеЗаявки);
	Массив.Добавить(СтрокаТЧ.ОформлениеДокументов);
	Массив.Добавить(СтрокаТЧ.РаботаСПроизводителем);
	
	КоличествоНулей = 0;
	Для Каждого Стр Из Массив Цикл
		Если Стр = 0 Тогда
			КоличествоНулей = КоличествоНулей + 1;
		КонецЕсли;
	КонецЦикла;
		
	Если КоличествоНулей = 1 Тогда
		СтрокаТЧ.СуммаКВыплате = СтрокаТЧ.СуммаКВыплате * 0.5;
	ИначеЕсли КоличествоНулей >= 2 Тогда
		СтрокаТЧ.СуммаКВыплате = 0;
	КонецЕсли;
			
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Процедура ДобавитьКомментарийДляЯчейкиНаСервере(ИмяТекущегоЭлемента, Инженер, Комментарий)
	МенеджерЗаписи = РегистрыСведений.смартASP_КомментарииДляЯчеек.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Период = Объект.Дата;
	МенеджерЗаписи.Инженер = Инженер;
	МенеджерЗаписи.ТипБонуса = ИмяТекущегоЭлемента;
	МенеджерЗаписи.Комментарий = Комментарий;

	МенеджерЗаписи.Записать();
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура ДобавитьКомментарийДляЯчейки(Команда)
	ИмяТекущегоЭлемента = Элементы.НачислениеБонусов.ТекущийЭлемент.Имя;	
	Если ИмяТекущегоЭлемента = "НачислениеБонусовНомерСтроки" Тогда
		Сообщить("Не выбрана ячейка!");
		Возврат;
	КонецЕсли;
	
	Инженер = Элементы.НачислениеБонусов.ТекущиеДанные.Инженер;
	Если Инженер = ПустаяСсылкаСправочникаПользователи() Тогда
		Сообщить("Не заполнено поле ""Инженер""!");
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки", ЭтотОбъект);
 
    ПоказатьВводСтроки(
        Оповещение,
        ,
        "Введите комментарий",
        0,
        Истина
    );
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура ПослеВводаСтроки(Результат, Параметры) Экспорт

	ИмяТекущегоЭлемента = Элементы.НачислениеБонусов.ТекущийЭлемент.Имя;
	Инженер = Элементы.НачислениеБонусов.ТекущиеДанные.Инженер;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ДобавитьКомментарийДляЯчейкиНаСервере(ИмяТекущегоЭлемента, Инженер, Результат);
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Функция ПосмотретьКомментарийДляЯчейкиНаСервере(ИмяТекущегоЭлемента, Инженер)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ASP_КомментарииДляЯчеекСрезПоследних.Комментарий КАК Комментарий
		|ИЗ
		|	РегистрСведений.смартASP_КомментарииДляЯчеек.СрезПоследних(
		|			,
		|			Инженер = &Инженер
		|				И ТипБонуса = &ТипБонуса
		|				И НАЧАЛОПЕРИОДА(Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)) КАК ASP_КомментарииДляЯчеекСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	Запрос.УстановитьПараметр("Инженер", Инженер);
	Запрос.УстановитьПараметр("ТипБонуса", ИмяТекущегоЭлемента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Комментарий = "Для данной ячейки нет комментария!";
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Комментарий = ВыборкаДетальныеЗаписи.Комментарий;
	КонецЕсли;
	
	Возврат Комментарий;
КонецФункции

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура ПосмотретьКомментарийДляЯчейки(Команда)
	ИмяТекущегоЭлемента = Элементы.НачислениеБонусов.ТекущийЭлемент.Имя;
	Если ИмяТекущегоЭлемента = "НачислениеБонусовНомерСтроки" Тогда
		Сообщить("Не выбрана ячейка!");
		Возврат;
	КонецЕсли;
	
	Инженер = Элементы.НачислениеБонусов.ТекущиеДанные.Инженер;
	Если Инженер = ПустаяСсылкаСправочникаПользователи() Тогда
		Сообщить("Не заполнено поле ""Инженер""!");
		Возврат;
	КонецЕсли;
	
	Комментарий = ПосмотретьКомментарийДляЯчейкиНаСервере(ИмяТекущегоЭлемента, Инженер);
	
	
	ПоказатьЗначение(,Комментарий);
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервереБезКонтекста
Функция ПустаяСсылкаСправочникаПользователи()
	Возврат Справочники.Пользователи.ПустаяСсылка();
КонецФункции

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  
	Если НЕ ЗначениеЗаполнено(Объект.смартСтатусРасчетаБонусов) Тогда
		Объект.смартСтатусРасчетаБонусов = Перечисления.смартСтатусыДокументовРасчетаБонусов.ВРаботе;
	КонецЕсли;	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	

	УстановитьДоступностьПоСтатусуРасчета();
	//--#1288 смарт: Лопато 26.12.2022
	
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Номер = ""
КонецПроцедуры

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура УстановитьДоступностьПоСтатусуРасчета()

	смартASP_ОбщийМодуль.смартУстановитьТолькоПросмотрФормыРасчетЗавершен(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьДоступностьПоСтатусуРасчета();

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#Область ПодключаемыеКоманды

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#КонецОбласти

#Область ОбработчикиКомандФормы

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#КонецОбласти
